legacy/docs/Go/understanding-slices-in-go.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Understanding slices in Go</title>
<meta name="author" content="Vernon Grant" />
<meta name="keywords" content="Go, Slices, Arrays" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="https://www.vernon-grant.com/cropped-favicon-32x32.png" sizes="32x32" /><link rel="icon" href="https://www.vernon-grant.com/cropped-favicon-192x192.png" sizes="192x192" /><link rel="apple-touch-icon" href="https://www.vernon-grant.com/cropped-favicon-180x180.png" /><link rel="stylesheet" href="https://www.vernon-grant.com/stylesheet.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Understanding slices in Go
<br>
<span class="subtitle">Slices in go are dynamically resizable data structures</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org538b5ed">The difference between arrays and slices</a></li>
<li><a href="#org25d1eca">Keeping memory allocations in mind</a></li>
<li><a href="#orgaef9539">Inserting an entry into a slice</a>
<ul>
<li><a href="#org67824e1">Inserting an entry into the front of a slice</a></li>
<li><a href="#org1d2ddd0">Inserting an entry onto the back</a></li>
<li><a href="#org27c6930">Inserting an entry at <code>index</code></a></li>
</ul>
</li>
<li><a href="#orgeede10e">Deleting an entry from a slice</a>
<ul>
<li><a href="#orgd55cc84">Deleting the first entry</a></li>
<li><a href="#org9cc7e66">Deleting the last entry</a></li>
<li><a href="#org0461ced">Deleting an entry at <code>index</code></a></li>
</ul>
</li>
<li><a href="#orga5a5861">Appending two or more slices</a></li>
</ul>
</div>
</div>

<div id="outline-container-org538b5ed" class="outline-2">
<h2 id="org538b5ed">The difference between arrays and slices</h2>
<div class="outline-text-2" id="text-org538b5ed">
<p>
Slices in go are dynamically resizable data structures. Just as most other data
structures, slices are built on top of standard arrays. Arrays are fixed in
terms of size, meaning when we define an array and give it a size, we can't
later increase the arrays capacity to account for additional data. Our only
option will be to allocate a new array, big enough to hold the additional data
we'd like to store.
</p>

<p>
In Go array are created like this:
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func main()   {
    collection := [5]int{1,2,3,4,5}

    fmt.Println(collection)
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">: [1 2 3 4 5]
</pre>
</div>

<p>
Slices on the other hand are created in a very similar way, it's almost
identical. <b>The only difference is that we don't specify a size</b>.
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func main()   {
    collection := []int{1,2,3,4,5}

    fmt.Println(collection)
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">: [1 2 3 4 5]
</pre>
</div>

<p>
A slice has three key properties, a <code>pointer</code> that points to the underlying
array, a <code>length</code> that specifies the current length of the slice and a
<code>capacity</code>, that specifies the maximum size of the slice before a re-allocation
is required.
</p>

<p>
The following functions can be used to get some of these properties:
</p>

<ul class="org-ul">
<li><code>len(yourSlice)</code> Get a slice's length.</li>
<li><code>cap(yourSlice)</code> Get a slice's capacity.</li>
</ul>

<p>
Go gives us a convenient interface we can use to construct slices freely and in
an performant manner: <code>collection[low:high:max]</code>. This convenient little
interface can create confusion when constructing new slices, especially for
beginners like me. And that's because <b>a slice can be constructed from an
existing array, this happens as soon as we use the previously mentioned
interface on any array instance</b>.
</p>

<p>
When we do this, we are given a slice. But the important thing to note is, that
<b>the slice's initial underlying array is the array that was used to construct
the slice</b>. This is very important because it means that any changes we make to
the slice will reflect in the initial array as its now referenced as the slices
underlying array.
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func main()   {

    // This is an array.
    collection := [5]int{1,2,3,4,5}

    // This is a slice, constructed from the above array. And this slice's
    // underlying array is the above array.
    chunk := collection[:2]

    fmt.Println(collection)
    fmt.Println(chunk)

    for i := 0; i &lt; 10; i++ {
        chunk = append(chunk, i)
    }

    fmt.Println(collection)
    fmt.Println(chunk)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">: [1 2 3 4 5]
: [1 2 3]
: [1 2 3 0 1]
: [1 2 3 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19]
</pre>
</div>

<p>
This brings us to another important point, <b>slices are passed by reference</b> and
<b>arrays are passed by copy</b>. This has a few obvious implications, passing large
arrays to a function can be slow. And care needs to be taken when passing around
slices as this might result in unwanted side effects.
</p>

<p>
What makes things even more confusing is that changes to a slice that was
constructed from an array, also effects the array that was used during the slice
creation. So in that sense <b>an array can be converted to a slice, passed to a
function and the original array might also experience side effects</b>:
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func replaceEvenNumbers(chunk []int, replacement int) {
    for i, v := range chunk {
        if (v % 2 == 0) {
            chunk[i] = replacement
        }
    }
}

func main()   {
    // This is an array.
    collection := [5]int{1,2,3,4,5}

    // Convert our array into a slice, and call function.
    replaceEvenNumbers(collection[:], 0)
    fmt.Println(collection)
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">: [1 0 3 0 5]
</pre>
</div>

<p>
When constructing a slice from an array, the slices underlying array is linked
(referenced) as the slices underlying array, as long as the slice's capacity
remains the same. In other words, <b>as soon as the slice's capacity changes the
reference to the original array that was used during its construction is lost</b>.
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func main()   {
    // This is an array.
    collection := [5]int{1,2,3,4,5}

    // This is a slice, constructed from the above array. And this slice's
    // underlying array is the above array.
    chunk := collection[:]
    fmt.Println(cap(chunk))

    // Force the chunk to capacity to change.
    chunk = append(chunk, 6)
    fmt.Println(cap(chunk))

    // Make a change to the slice's first entry.
    chunk[0] = 100

    fmt.Println(collection)
    fmt.Println(chunk)
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">: 5
: 10
: [1 2 3 4 5]
: [100 2 3 4 5 6]
</pre>
</div>

<p>
As you can see the <code>collection</code> array remains unchanged, this makes sense as the
slice had to allocate more memory to account for the additional entry. And
therefor lost its reference the original array.
</p>
</div>
</div>

<div id="outline-container-org25d1eca" class="outline-2">
<h2 id="org25d1eca">Keeping memory allocations in mind</h2>
<div class="outline-text-2" id="text-org25d1eca">
<p>
When adding entries to a slice we need to keep in mind memory allocation, for
performance reasons. When inserting a single entry to the front of an existing
slice, we can just simply create a new slice and append the old slice to it.
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func main() {
    collection := []int{1,2,3,4,5}

    // Construct a new slice and append the collection to it.
    collection = append([]int{10}, collection...);
    fmt.Println(collection)
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">: [10 1 2 3 4 5]
</pre>
</div>

<p>
Since we're only adding a single entry to the front of our slice, its not much
of a concern in terms of performance as this might only account for a single
memory allocation.
</p>

<p>
However, when we need to add multiple entries to the front of a slice, we need
to consider a different approach to limit the number of memory allocations. See
the below performance differences between allocating a new correctly sized slice
and continuously appending to the front of an existing slice:
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"
import "testing"

func continuouslyAllocated(b *testing.B) {
    // You don't want to do something like this.
    collection := []int{13, 24, 34, 44}
    for i := 0; i &lt; b.N; i++ {
        collection = append([]int{i}, collection...)
    }
}

func preAllocated(b *testing.B) {
    collection := []int{13, 24, 34, 44}
    combinedLength := len(collection) + b.N

    // Allocate a new slice here, big enough to hold all entries.
    newCollection := make([]int, combinedLength)

    // Set the new collections values.
    for i := len(collection); i &lt; combinedLength; i++ {
        newCollection[i] = i
    }

    // Copy over our old collections data into the new collection.
    copy(newCollection, collection)
}

func main() {
    continuesResult := testing.Benchmark(continuouslyAllocated)
    fmt.Println("Slice continuously allocated:")
    fmt.Println("Allocations: ", continuesResult.MemAllocs)
    fmt.Println("Time: ", continuesResult.T)

    fmt.Println()

    preResult := testing.Benchmark(preAllocated)
    fmt.Println("Slice pre-allocated:")
    fmt.Println("Allocations: ", preResult.MemAllocs)
    fmt.Println("Time: ", preResult.T)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">: Slice continuously allocated:
: Allocations:  596749
: Time:  20.259569667s
:
: Slice pre-allocated:
: Allocations:  1
: Time:  3.722680916s
</pre>
</div>

<p>
As you can see memory allocations are expensive and should be considered at all
times.
</p>
</div>
</div>

<div id="outline-container-orgaef9539" class="outline-2">
<h2 id="orgaef9539">Inserting an entry into a slice</h2>
<div class="outline-text-2" id="text-orgaef9539">
<p>
Now let's look at some practical examples of inserting entries into a slice and
things we'll need to keep in mind when doing so.
</p>
</div>

<div id="outline-container-org67824e1" class="outline-3">
<h3 id="org67824e1">Inserting an entry into the front of a slice</h3>
<div class="outline-text-3" id="text-org67824e1">
<p>
We can insert an entry into the front of a slice by simply constructing a new
slice and appending our current slice to it.
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func main() {
    collection := []int{2,3,4,5,6}
    collection = append([]int{1}, collection...)
    fmt.Println(collection)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">: [1 2 3 4 5 6]
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d2ddd0" class="outline-3">
<h3 id="org1d2ddd0">Inserting an entry onto the back</h3>
<div class="outline-text-3" id="text-org1d2ddd0">
<p>
Adding a new entry to the end of a slice is very simple:
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

func main() {
    collection := []int{1,2,3,4,5}
    collection = append(collection, 6)
    fmt.Println(collection)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">: [1 2 3 4 5 6]
</pre>
</div>
</div>
</div>

<div id="outline-container-org27c6930" class="outline-3">
<h3 id="org27c6930">Inserting an entry at <code>index</code></h3>
<div class="outline-text-3" id="text-org27c6930">
<p>
When inserting an entry into some <code>index</code> all we need to do is split the slice
into two new slices and append the new entry in between.
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"

const index = 1
const value = 3

func main() {
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">: [1 2 3 4 5 6]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgeede10e" class="outline-2">
<h2 id="orgeede10e">Deleting an entry from a slice</h2>
<div class="outline-text-2" id="text-orgeede10e">
</div>
<div id="outline-container-orgd55cc84" class="outline-3">
<h3 id="orgd55cc84">Deleting the first entry</h3>
</div>
<div id="outline-container-org9cc7e66" class="outline-3">
<h3 id="org9cc7e66">Deleting the last entry</h3>
</div>
<div id="outline-container-org0461ced" class="outline-3">
<h3 id="org0461ced">Deleting an entry at <code>index</code></h3>
</div>
</div>

<div id="outline-container-orga5a5861" class="outline-2">
<h2 id="orga5a5861">Appending two or more slices</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vernon Grant (<a href="mailto:info@vernon-grant.com">info@vernon-grant.com</a>)</p>
<p class="updated">Updated on: 2023-09-20 Wed 17:05</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
<p class="validation"></p>
</div>
</body>
</html>